
/*   String Alert Messages   */

"MsgFatalErrorNotCaught" = "An unrecoverable error has occurred, and <<<kGameName>>> cannot continue.";
"MsgInsufficientCPU" = "This Macintosh does not contain the minimum processor (CPU) required to play <<<kGameName>>>.";
"MsgInsufficientCPUSpeed" = "<<<kGameName>>> requires a CPU running at %s MHz or faster.";
"MsgInsufficientSystemVersion" = "<<<kGameName>>> requires MacOS version %s or later.";
"MsgNeedSoundMgr" = "<<<kGameName>>> requires Sound Manager %s or later.";
"MsgNeedQuickTime" = "<<<kGameName>>> requires QuickTime %s or later.";
"MsgQuickTimeInit" = "An error occurred while initializing QuickTime.";
"MsgNeedOpenGL" = "<<<kGameName>>> requires OpenGL version %s or later.";
"MsgNeedOpenGL112" = "<<<kGameName>>> requires a minimum OpenGL version of 1.1.2.";
"MsgNeedInternetConfig" = "<<<kGameName>>> requires Internet Config %s or later.";
"MsgHasSlashInPathName" = "The path “%s” contains a slash (/), backslash (\\), or period (.).";
"MsgResNotFound" = "A required resource was not found.";
"MsgCDROMNotVerified" = "<<<kGameName>>> game CD-ROM was not found.";
"MsgInsufficientCDROM" = "<<<kGameName>>> requires at least a %s speed CD-ROM drive or faster.";
"MsgInsufficientBitDepth" = "Your color depth must be %s to run <<<kGameName>>> in a window.";
"MsgMemoryAllocationFailed" = "A memory allocation error has been detected. ";
"MsgInsufficientHDSpace" = "<<<kGameName>>> requires at least %s of free disk space.";
"MsgMemoryCriticallyLow" = "<<<kGameName>>> is running low on memory.";
"MsgMemoryExhausted" = "<<<kGameName>>> has run critically low on memory and cannot continue. ";
"MsgFileNotFound" = "A required file (%s) could not be found.";
"MsgGLHardwareNotFound" = "Unable to locate suitable OpenGL 3D acceleration hardware.";
"MsgNotEnoughVRAM" = "Your main video card must have at least %s MB of VRAM to play <<<kGameName>>>.";
"MsgCantRunAppFromCDROM" = "<<<kGameName>>> cannot be played from the CD or DVD drive.";
"MsgCantAllocSndChannel" = "Mac OS X's sound system could not be initialized.";
"MsgVolCaseSensitive" = "<<<kGameName>>> cannot be played on a Case-sensitive formatted volume.";

/*   String Alert Explains   */

"ExplainFatalErrorNotCaught" = "Press OK to quit the program.";
"ExplainInsufficientCPU" = "Please consult the game's System Requirements for exact hardware specifications.";
"ExplainInsufficientCPUSpeed" = "To bypass this check, hold down the 'p' key when you start <<<kGameName>>>.";
"ExplainInsufficientSystemVersion" = "Visit http://www.apple.com for information on upgrading your computer's System Software or consult your Apple dealer.";
"ExplainNeedSoundMgr" = "";
"ExplainNeedQuickTime" = "Visit http://www.apple.com to download the necessary software.";
"ExplainQuickTimeInit" = "";
"ExplainNeedOpenGL" = "";
"ExplainNeedOpenGL112" = "";
"ExplainNeedInternetConfig" = "";
"ExplainHasSlashInPathName" = "Remove the character from the appropriate Folder’s name and try again.";
"ExplainResNotFound" = "";
"ExplainCDROMNotVerified" = "Make sure the original game CD is in your Mac’s CD-ROM drive and try again.";
"ExplainInsufficientCDROM" = "";
"ExplainInsufficientBitDepth" = "Go to the Displays panel in System Preferences to adjust your monitor.";
"ExplainMemoryAllocationFailed" = "If this error is fatal, <<<kGameName>>> will quit.";
"ExplainInsufficientHDSpace" = "Free up some space on your local disk and then re-launch <<<kGameName>>>.";
"ExplainMemoryCriticallyLow" = "";
"ExplainMemoryExhausted" = "";
"ExplainFileNotFound" = "Please re-install <<<kGameName>>>.";
"ExplainGLHardwareNotFound" = "<<<kGameName>>> requires an OpenGL-supported video card.";
"ExplainNotEnoughVRAM" = "Make sure your computer meets the display requirements specified in the Read Me file.";
"ExplainCantRunAppFromCDROM" = "Please drag the <<<kGameName>>> icon to your hard disk and try again.";
"ExplainCantAllocSndChannel" = "Use the Audio MIDI Setup utility (found in the Applications/Utilities folder) to ensure your Mac's audio output is set to 44 Khz, 16-bit.";
"ExplainVolCaseSensitive" = "For more information, please consult the game's Read Me file.";

/*   Key Names (used by GetKeyNameText)   */

"KeyName1" = "esc";
"KeyName2" = "1";
"KeyName3" = "2";
"KeyName4" = "3";
"KeyName5" = "4";
"KeyName6" = "5";
"KeyName7" = "6";
"KeyName8" = "7";
"KeyName9" = "8";
"KeyName10" = "9";
"KeyName11" = "0";
"KeyName12" = "-";
"KeyName13" = "=";
"KeyName14" = "Delete";
"KeyName15" = "Tab";
"KeyName16" = "Q";
"KeyName17" = "W";
"KeyName18" = "E";
"KeyName19" = "R";
"KeyName20" = "T";
"KeyName21" = "Y";
"KeyName22" = "U";
"KeyName23" = "I";
"KeyName24" = "O";
"KeyName25" = "P";
"KeyName26" = "[";
"KeyName27" = "]";
"KeyName28" = "Return";
"KeyName29" = "Apple";
"KeyName30" = "A";
"KeyName31" = "S";
"KeyName32" = "D";
"KeyName33" = "F";
"KeyName34" = "G";
"KeyName35" = "H";
"KeyName36" = "J";
"KeyName37" = "K";
"KeyName38" = "L";
"KeyName39" = ";";
"KeyName40" = "\'";
"KeyName41" = "`";
"KeyName42" = "Shift";
"KeyName43" = "\\";
"KeyName44" = "Z";
"KeyName45" = "X";
"KeyName46" = "C";
"KeyName47" = "V";
"KeyName48" = "B";
"KeyName49" = "N";
"KeyName50" = "M";
"KeyName51" = ",";
"KeyName52" = ".";
"KeyName53" = "/";
"KeyName54" = "Shift";
"KeyName55" = "Pad *";
"KeyName56" = "Option";
"KeyName57" = "Space";
"KeyName58" = "Caps Lock";
"KeyName59" = "F1";
"KeyName60" = "F2";
"KeyName61" = "F3";
"KeyName62" = "F4";
"KeyName63" = "F5";
"KeyName64" = "F6";
"KeyName65" = "F7";
"KeyName66" = "F8";
"KeyName67" = "F9";
"KeyName68" = "F10";
"KeyName69" = "F15";
"KeyName70" = "F14";
"KeyName71" = "Pad 7";
"KeyName72" = "Pad 8";
"KeyName73" = "Pad 9";
"KeyName74" = "Pad -";
"KeyName75" = "Pad 4";
"KeyName76" = "Pad 5";
"KeyName77" = "Pad 6";
"KeyName78" = "Pad +";
"KeyName79" = "Pad 1";
"KeyName80" = "Pad 2";
"KeyName81" = "Pad 3";
"KeyName82" = "Pad 0";
"KeyName83" = "Pad .";
"KeyName87" = "F11";
"KeyName88" = "F12";
"KeyName100" = "F13";
"KeyName101" = "F14";
"KeyName102" = "F15";
"KeyName103" = "F16";
"KeyName116" = "Pad =";
"KeyName141" = "Pad =";
"KeyName156" = "Enter";
"KeyName181" = "Pad /";
"KeyName183" = "F13";
"KeyName197" = "Numlock";
"KeyName199" = "Home";
"KeyName200" = "Up Arrow";
"KeyName201" = "Page Up";
"KeyName203" = "Left Arrow";
"KeyName205" = "Right Arrow";
"KeyName207" = "End";
"KeyName208" = "Down Arrow";
"KeyName209" = "Page Down";
"KeyName210" = "Help";
"KeyName211" = "Del";

/*   Time Zone names   */

"Standard" = "Standard";
"Daylight" = "Daylight";

"TimeZone1" = "Samoa %@ Time";
"TimeZone2" = "Hawaiian %@ Time";
"TimeZone3" = "Alaskan %@ Time";
"TimeZone4" = "Pacific %@ Time";
"TimeZone5" = "Mountain %@ Time";
"TimeZone6" = "Central %@ Time";
"TimeZone7" = "Eastern %@ Time";
"TimeZone8" = "Atlantic %@ Time";
"TimeZone9" = "SA Eastern %@ Time";
"TimeZone10" = "Mid-Atlantic %@ Time";
"TimeZone11" = "Azores %@ Time";
"TimeZone12" = "GMT %@ Time";
"TimeZone13" = "W. Europe %@ Time";
"TimeZone14" = "E. Europe %@ Time";
"TimeZone15" = "Russian %@ Time";
"TimeZone16" = "Arabian %@ Time";
"TimeZone17" = "West Asia %@ Time";
"TimeZone18" = "Central Asia %@ Time";
"TimeZone19" = "SE Asia %@ Time";
"TimeZone20" = "China %@ Time";
"TimeZone21" = "Tokyo %@ Time";
"TimeZone22" = "West Pacific %@ Time";
"TimeZone23" = "Central Pacific %@ Time";
"TimeZone24" = "Dateline %@ Time";

/*   CPU Names   */

"Cpu1" = "PowerPC 601";
"Cpu2" = "PowerPC 602";
"Cpu3" = "PowerPC 603";
"Cpu4" = "PowerPC 603e";
"Cpu5" = "PowerPC 603ev";
"Cpu6" = "PowerPC 604";
"Cpu7" = "PowerPC 604e";
"Cpu8" = "PowerPC 620";
"Cpu9" = "PowerPC 750 (G3)";
"Cpu10" = "PowerPC 7400 (G4)";
"Cpu11" = "PowerPC 7450 (G4e)";
"Cpu100" = "PowerPC 970 (G5)";

/*   MessageBox button titles   */

"Yes" = "Yes";
"No" = "No";
"Cancel" = "Cancel";
"Abort" = "Abort";
"Retry" = "Retry";
"Ignore" = "Ignore";
"Continue" = "Continue";
"Try" = "Try Again";

/*   Miscellaneous Alert and Dialog text   */

"AskForCDText" = "Please insert the CD “%s” into your CD-ROM drive, or press Quit to exit the game.";
"untitled" = "Untitled";

/*   Game-specific strings from Win32 resource  */


/*   About Box credits  */

"Credits" = "








Mac OS X Programming

Ken Cobb
Phil Sulak


";
